char *STmainmenu  = "ГЛАВНОЕ МЕНЮ    Монитор        |Журнал событий |Конфигурация   |Регуляторы     |Предупреждения |Защиты         |Сервис         |Протокол обмена|";
char *STregs	    = ">РЕГУЛЯТОРЫ      Регулятор Udc | Регулятор Q   | Регулятор PLL |";
char *STalarms	  = ">ЗАЩИТЫ          МТЗ преобразов| Высокое Udc   | Низкое Udc    | Разряд Udc    | Низкое Uсинхр.| Высокое Uсинхр| Температура   | Защита диодов | Защита резист.| Высокочаст.ток|";
char *STconfig	  = ">КОНФИГУРАЦИЯ    Уставки       | Заряд / разряд| Режим регулир.| Встроен.генер.| Фильтр. измер.| Вентиляторы   | Спящий режим  | Управл.мостами| Основн/резервн| Диодный режим | Режим ШИМ     | Разница Udc1&2| Пост.составл. |";
char *STrefs	 	  = ">УСТАВКИ         Уставка Udc   | Уставка Q     | Уставка ¦     |";
char *STzarad	 	  = ">ЗАРЯД / РАЗРЯД  Минимальн. Udc| Минимальн. Us | Длительн. КМ1 |";

char *STstandby	  = ">СПЯЩИЙ РЕЖИМ    Включение     | Отключение    |";
char *STbridge		=	">УПРАВЛ.МОСТАМИ  Вкл/Откл моста| Уставка вкл.  | Уставка откл. | Ручной выбор  | Коррекция угла| Корр. пар-ров |";
char *STAutoBridge= ">>ВКЛ/ОТКЛ МОСТА  Вручную         Автоматически ";
char *STManBridge = ">>РУЧНОЙ ВЫБОР    Мост 1          Мост 1 & 2    ";
char *STmainch    = ">>ОСНОВН/РЕЗЕРВН  Резервный       Основной      ";
char *STparamcorr = ">>КОРР. ПАР-РОВ   Без коррекции   С коррекцией  ";

char *STDiodeMode		 = ">ДИОДНЫЙ РЕЖИМ   Вкл./Откл.    | Уставка вкл.  | Уставка откл. |";
char *STEnaDiodeMode = ">>ВКЛ./ОТКЛ.      Не разрешено    Разрешено     ";

char *STintgen	 	= ">ВСТРОЕН.ГЕНЕР.  Вкл./Выкл.    | Фильтрация    | Коэффициент К1| Коэффициент К2|";
char *STintgenena = ">>ВСТРОЕН.ГЕНЕР.  Отключен        Включен         PLL           ";

char *STfiltrs    = ">>ФИЛЬТР.ИЗМЕР.   Фильтрация DC|  Фильтрация I1|  Фильтрация P1|  Фильтрация Q1|  Фильтрация I2|  Фильтрация P2|  Фильтрация Q2|  Фильтрация Us|";

char *STvent	  	= ">>ВЕНТИЛЯТОРЫ     Вкл.вентилят.|  Откл.вентилят|";

char *STservice   = ">СЕРВИС          Уст.Дата/Время| Сохр.параметры| Датчики       |";
char *STsensors    =">>ДАТЧИКИ         Калибровка   |  Смещ.нуля Udc|  Смещ.нуля Us |  Смещ.нуля I1 |  Смещ.нуля I2 |  Смещ.нуля I3 |  Смещ.нуля I4 |";

char *STfixugol	  = ">>РЕЖИМ РЕГУЛИР.  Регулятор Udc   Фикс.угол     ";
char *STTIMOffset = ">>РЕЖИМ ШИМ       Сихронная       1/2 периода     1/4 периода   ";
char *STFixCorrect = ">>ПОСТ.СОСТАВЛ.   Отключен        Включен       ";


char *STuarts     =">ПРОТОКОЛ ОБМЕНА Порт X6       | Порт X7       | Порт Х13      |";
char *STuartparams=">>ПАР-РЫ ПОРТА    Скорость     |  Четность     |  Стоп-биты    |  Адрес Modbus |  Адрес 2      |";
char *STuartSpeed =">>>СКОРОСТЬ        9600 бод        19200 бод       38400 бод       57600 бод       115200 бод      230400 бод    ";
char *STuartParity=">>>ЧЕТНОСТЬ        Odd             Even            Без четности ";
char *STuartStop  =">>>СТОП-БИТЫ       1 стоп-бит      2 стоп-бита  ";

